Revit 2024 API
ConduitSettings Class
 The conduit settings.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public class ConduitSettings : Element
Visual Basic
Public Class ConduitSettings _
	Inherits Element
Visual C++
public ref class ConduitSettings : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Electrical.ConduitSettings
See Also
ConduitSettings Members
Autodesk.Revit.DB.Electrical Namespace